# Bar Terminations Data Constructor

Source: https://www.revitapidocs.com/2026/30435fe5-ba56-431c-27f4-58d586d16bc9.htm

---

| Bar Terminations Data Constructor |
| --- |

Creates a new instance of BarTerminationData with the default values.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public BarTerminationsData(
	Document document
)
```

```
Public Sub New (
	document As Document
)
```

```
public:
BarTerminationsData(
	Document^ document
)
```

```
new :
        document : Document -> BarTerminationsData
```

#### Parameters

document Document
:   The document containing the hook type ids, end treatment ids and crank type ids.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace